SLS/src/DataProcessors/ЗагрузкаМетаданныхOdata/ЗагрузкаМетаданныхOdata.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаМетаданныхOdata</name>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации1С</types>
    </type>
  </attributes>
  <attributes>
    <name>База</name>
    <type>
      <types>CatalogRef.БазыДанных1С</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

SLS/src/Catalogs/ИдентификаторыОбъектовМетаданныхКонфигураций/ИдентификаторыОбъектовМетаданныхКонфигураций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИдентификаторыОбъектовМетаданныхКонфигураций</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БизнесПроцессы</name>
      <description>Бизнес-процессы</description>
    </items>
    <items>
      <name>Документы</name>
      <description>Документы</description>
    </items>
    <items>
      <name>ЖурналыДокументов</name>
      <description>Журналы документов</description>
    </items>
    <items>
      <name>Задачи</name>
      <description>Задачи</description>
    </items>
    <items>
      <name>Константы</name>
      <description>Константы</description>
    </items>
    <items>
      <name>Обработки</name>
      <description>Обработки</description>
    </items>
    <items>
      <name>Отчеты</name>
      <description>Отчеты</description>
    </items>
    <items>
      <name>ПланыВидовРасчета</name>
      <description>Планы видов расчета</description>
    </items>
    <items>
      <name>ПланыВидовХарактеристик</name>
      <description>Планы видов характеристик</description>
    </items>
    <items>
      <name>ПланыОбмена</name>
      <description>Планы обмена</description>
    </items>
    <items>
      <name>ПланыСчетов</name>
      <description>Планы счетов</description>
    </items>
    <items>
      <name>Подсистемы</name>
      <description>Подсистемы</description>
    </items>
    <items>
      <name>РегистрыБухгалтерии</name>
      <description>Регистры бухгалтерии</description>
    </items>
    <items>
      <name>РегистрыНакопления</name>
      <description>Регистры накопления</description>
    </items>
    <items>
      <name>РегистрыРасчета</name>
      <description>Регистры расчета</description>
    </items>
    <items>
      <name>РегистрыСведений</name>
      <description>Регистры сведений</description>
    </items>
    <items>
      <name>Роли</name>
      <description>Роли</description>
    </items>
    <items>
      <name>Справочники</name>
      <description>Справочники</description>
    </items>
  </predefined>
  <attributes>
    <name>Конфигурация1С</name>
    <type>
      <types>CatalogRef.Конфигурации1С</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <comment>Например, &quot;ОбъектыАдресацииЗадач&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмя</name>
    <comment>Например, &quot;ПланВидовХарактеристик.ОбъектыАдресацииЗадач&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>430</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТаблицыSQL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличныеЧасти</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТаблицыSQL</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Реквизиты</name>
    <attributes>
      <name>ИмяТЧ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяSQL</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗнч</name>
      <type>
        <types>EnumRef.ИмяТипа1С</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SLS/src/DataProcessors/ЗагрузкаМетаданныхOdata/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Конфигурация") Тогда
		Объект.Конфигурация = Параметры.Конфигурация;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьМетаданныеНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Конфигурация1С", Объект.Конфигурация);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИдентификаторыОбъектовМетаданныхКонфигураций.Ссылка КАК Ссылка,
	|	ИдентификаторыОбъектовМетаданныхКонфигураций.ПолноеИмя КАК ПолноеИмя,
	|	ИдентификаторыОбъектовМетаданныхКонфигураций.ПометкаУдаления КАК ПометкаУдаления,
	|	Ложь КАК Загружен
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданныхКонфигураций КАК ИдентификаторыОбъектовМетаданныхКонфигураций
	|ГДЕ
	|	ИдентификаторыОбъектовМетаданныхКонфигураций.Конфигурация1С = &Конфигурация1С";
	
	ТЧМТД = Запрос.Выполнить().Выгрузить();
	ТЧМТД.Индексы.Добавить("ПолноеИмя");
	
	//ДанныеСписка = МониторингСервисов.ДанныеСпискаВБазеПоПротоколуOData(
	ДанныеСписка = ЗапросыOdata.ДанныеСпискаВБазе(
		Объект.База,
		"Справочник.ИдентификаторыОбъектовМетаданных",
		120,
		"Description asc",
		"DeletionMark,Description,ПолноеИмя,Синоним,Имя,Parent_Key,Parent/Description,Parent/ПолноеИмя",
		,
		"Parent"
	);
	
	Для Каждого ОписаниеМТД ИЗ ДанныеСписка Цикл
		
		Если ОписаниеМТД["DeletionMark"] Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОписаниеМТД["Parent_Key"])
			ИЛИ ОписаниеМТД["Parent_Key"] = "00000000-0000-0000-0000-000000000000"
			Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокиМТД = ТЧМТД.НайтиСтроки(Новый Структура("ПолноеИмя", ОписаниеМТД["ПолноеИмя"]));
		
		ОбъектМТД = Неопределено;
		Для Каждого СтрокаМТД Из СтрокиМТД Цикл
			СтрокаМТД.Загружен = Истина;
			ОбъектМТД = СтрокаМТД.Ссылка;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ОбъектМТД) Тогда
			ОбъектМТД = ОбъектМТД.ПолучитьОбъект();
			Если ОбъектМТД.ПометкаУдаления Тогда
				ОбъектМТД.УстановитьПометкуУдаления(Ложь);
				ОбъектМТД = ОбъектМТД.ПолучитьОбъект();
			КонецЕсли;
		Иначе
			ОбъектМТД = Справочники.ИдентификаторыОбъектовМетаданныхКонфигураций.СоздатьЭлемент();
			ОбъектМТД.Конфигурация1С = Объект.Конфигурация;
			ОбъектМТД.ПолноеИмя = ОписаниеМТД["ПолноеИмя"];
		КонецЕсли;
		
		ОбъектМТД.Наименование = ОписаниеМТД["Description"];
		ОбъектМТД.Синоним = ОписаниеМТД["Синоним"];
		ОбъектМТД.Имя = ОписаниеМТД["Имя"];
		
		ОбъектМТД.Родитель = РодительПоПолномуИмени(ОбъектМТД.ПолноеИмя);
		
		ОбъектМТД.ОбменДанными.Загрузка = Истина;
		ОбъектМТД.Записать();
		
	КонецЦикла;
	
	Сообщить("Метаданные загружены");
	
КонецПроцедуры

&НаСервере
Функция РодительПоПолномуИмени(Знач ПолноеИмя) Экспорт
	
	ПолноеИмя = СокрЛП(СтрРазделить(ПолноеИмя, ".", Ложь)[0]);
	Результат = Неопределено;
	Если ПолноеИмя = "Справочник" Тогда
		Результат = Справочники.ИдентификаторыОбъектовМетаданныхКонфигураций.Справочники;
	ИначеЕсли ПолноеИмя = "Документ" Тогда
		Результат = Справочники.ИдентификаторыОбъектовМетаданныхКонфигураций.Документы;
	ИначеЕсли ПолноеИмя = "БизнесПроцесс" Тогда
		Результат = Справочники.ИдентификаторыОбъектовМетаданныхКонфигураций.БизнесПроцессы;
	ИначеЕсли ПолноеИмя = "ЖурналДокументов" Тогда
		Результат = Справочники.ИдентификаторыОбъектовМетаданныхКонфигураций.ЖурналыДокументов;
	ИначеЕсли ПолноеИмя = "Задача" Тогда
		Результат = Справочники.ИдентификаторыОбъектовМетаданныхКонфигураций.Задачи;
	ИначеЕсли ПолноеИмя = "Константа" Тогда
		Результат = Справочники.ИдентификаторыОбъектовМетаданныхКонфигураций.Константы;
	ИначеЕсли ПолноеИмя = "Обработка" Тогда
		Результат = Справочники.ИдентификаторыОбъектовМетаданныхКонфигураций.Обработки;
	ИначеЕсли ПолноеИмя = "Отчет" Тогда
		Результат = Справочники.ИдентификаторыОбъектовМетаданныхКонфигураций.Отчеты;
	ИначеЕсли ПолноеИмя = "ПланВидовРасчета" Тогда
		Результат = Справочники.ИдентификаторыОбъектовМетаданныхКонфигураций.ПланыВидовРасчета;
	ИначеЕсли ПолноеИмя = "ПланВидовХарактеристик" Тогда
		Результат = Справочники.ИдентификаторыОбъектовМетаданныхКонфигураций.ПланыВидовХарактеристик;
	ИначеЕсли ПолноеИмя = "ПланОбмена" Тогда
		Результат = Справочники.ИдентификаторыОбъектовМетаданныхКонфигураций.ПланыОбмена;
	ИначеЕсли ПолноеИмя = "ПланСчетов" Тогда
		Результат = Справочники.ИдентификаторыОбъектовМетаданныхКонфигураций.ПланыСчетов;
	ИначеЕсли ПолноеИмя = "Подсистема" Тогда
		Результат = Справочники.ИдентификаторыОбъектовМетаданныхКонфигураций.Подсистемы;
	ИначеЕсли ПолноеИмя = "РегистрБухгалтерии" Тогда
		Результат = Справочники.ИдентификаторыОбъектовМетаданныхКонфигураций.РегистрыБухгалтерии;
	ИначеЕсли ПолноеИмя = "РегистрНакопления" Тогда
		Результат = Справочники.ИдентификаторыОбъектовМетаданныхКонфигураций.РегистрыНакопления;
	ИначеЕсли ПолноеИмя = "РегистрРасчета" Тогда
		Результат = Справочники.ИдентификаторыОбъектовМетаданныхКонфигураций.РегистрыРасчета;
	ИначеЕсли ПолноеИмя = "РегистрСведений" Тогда
		Результат = Справочники.ИдентификаторыОбъектовМетаданныхКонфигураций.РегистрыСведений;
	ИначеЕсли ПолноеИмя = "Роль" Тогда
		Результат = Справочники.ИдентификаторыОбъектовМетаданныхКонфигураций.Роли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьМетаданные(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Конфигурация) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.База) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьМетаданныеНаСервере();
	
КонецПроцедуры
